Revit 2026 API
ElementIsCurveDrivenFilter Class
 A filter used to match elements which are curve driven.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementIsCurveDrivenFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class ElementIsCurveDrivenFilter : ElementQuickFilter
Public Class ElementIsCurveDrivenFilter
	Inherits ElementQuickFilter
public ref class ElementIsCurveDrivenFilter : public ElementQuickFilter
type ElementIsCurveDrivenFilter =
    class
        inherit ElementQuickFilter
    end
The ElementIsCurveDrivenFilter type exposes the following members.
Constructors
Name | Description
ElementIsCurveDrivenFilter() |  Constructs a new instance of a filter to match only curve driven elements.
ElementIsCurveDrivenFilter(Boolean) |  Constructs a new instance of a filter to match only curve driven elements, with the option to match all elements which are not curve driven elements.
Top
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
(Inherited from ElementFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ElementFilter)
Top
Methods
Name | Description
Dispose
(Inherited from ElementFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
PassesFilter(Element) |  Applies the filter to a given element.
(Inherited from ElementFilter)
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
(Inherited from ElementFilter)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 The term "curve driven" indicates that the element's Location property is a LocationCurve. Example elements found by this filter include walls, beams, and curve elements. This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
See Also
Reference
Autodesk.Revit.DB Namespace